Readme.org
#+TITLE: Fet64's Emacs Configuration File
:PROPERTIES:
#+AUTHOR: Fet64
#+email: fet64@outlook.com
#+language: en
#+options: ':t toc:t author:t email:t num:nil
#+STARTUP: overview
#+PROPERTY: header-args+ :tangle "~/.config/emacs/init.el"
#+PROPERTY: header-args+ :mkdirp yes
:END:

This is a work in progress...

* Do this first - How to use
To tangle this file into =early-init.el= and =init.el= in the emacs-user-directory. You can do that by running (C-c C-c) in this code block:
#+ATTR-LATEX: :options minted
#+begin_src emacs-lisp :tangle no 
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((shell .t)))

  (org-babel-tangle)
#+end_src

#+CAPTION: Results from evaluating the elisp code to generate =early-init.el= and =init.el=.
#+RESULTS:
| ~/.config/emacs/init.el | ~/.config/emacs/early-init.el |

After you have tangled =early-init.el= and =init.el= you need to copy all supporting code from this git
to where you have your emacs config, usually =~/.config/emacs/=.


You can do that by running (C-c C-c) in this code block:
#+begin_src sh :tangle no

  cp -rvp snippets ~/.config/emacs/
  cp -rvp scripts ~/.config/emacs/
  cp -rvp emacs-custom.el ~/.config/emacs/
  cp -rvp images ~/.config/emacs/

#+end_src

#+CAPTION: Results from running copying supporting files.
#+RESULTS:
| snippets                              | -> | /Users/au/.config/emacs/snippets                              |
| snippets/org-mode                     | -> | /Users/au/.config/emacs/snippets/org-mode                     |
| snippets/org-mode/org_src_block       | -> | /Users/au/.config/emacs/snippets/org-mode/org_src_block       |
| snippets/org-mode/org_elisp_src_block | -> | /Users/au/.config/emacs/snippets/org-mode/org_elisp_src_block |
| scripts                               | -> | /Users/au/.config/emacs/scripts                               |
| scripts/buffer-move.el                | -> | /Users/au/.config/emacs/scripts/buffer-move.el                |
| emacs-custom.el                       | -> | /Users/au/.config/emacs/emacs-custom.el                       |
| images                                | -> | /Users/au/.config/emacs/images                                |
| images/emacs.png                      | -> | /Users/au/.config/emacs/images/emacs.png                      |

You can now restart Emacs. It will take some time to download all the packages and compile them. You may also need to accept that the theme can run elisp code. When done, restart again and your up and running this config.


* Start
** Early-init.el
#+begin_src emacs-lisp :tangle "~/.config/emacs/early-init.el"
  ;;; early-init.el --- Fet64's early-init.el file
  ;;; Commentary: auto generated (tangled) from Readme.org
  ;;; Code:

  (setq package-enable-at-startup nil)

  ;; Garbage collections
  (setq gc-cons-percentage 0.6)

  ;; Compile warnings
  (setq warning-minimum-level :emergency)
  (setq native-comp-async-report-warnings-errors 'silent)
  (setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))

  ;; Misc optimizations
  (setq idle-update-delay 1.0)
  (setq-default bidi-display-reordering 'left-to-right
				bidi-paragraph-direction 'left-to-right)

  (setq-default cursor-in-non-selected-windows nil)
  (setq highlight-nonselected-windows nil)
  (setq fast-but-imprecise-scrolling t)
  (setq inhibit-compacting-font-caches t)

  ;; This makes the Aqua titlebar color the same as Emacs
  (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
  ;; Remove icon in Aqua titlebar
  (setq ns-use-proxy-icon nil)
  ;; Remove fram title from Aqua titlebar
  (setq frame-title-format nil)

  ;;; early-init.el ends here

#+end_src

** Header in init.el
#+BEGIN_SRC emacs-lisp
  ;;; init.el --- Fet64's init.el
  ;;; Commentary: auto generated (tangled) from Readme.org
  ;;; Code:
#+END_SRC
** Package Management
#+BEGIN_SRC emacs-lisp
  (setq warning-suppress-log-types '((package reinitialization)))
  (package-initialize)
  (unless (assoc-default "melpa" package-archives)
	  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t))

	(unless (assoc-default "nongnu" package-archives)
	  (add-to-list 'package-archives '("nongnu" . "https://elpa.nongnu.org/nongnu/") t))

	(unless (package-installed-p 'use-package)
	  (package-install 'use-package))
	(setq use-package-verbose t)
	(setq use-package-always-ensure t)
	(require 'use-package)
	(use-package quelpa)
	(use-package quelpa-use-package)
	(quelpa-use-package-activate-advice)
	(use-package auto-compile
	  :config (auto-compile-on-load-mode))
	(setq load-prefer-newer t)

  (use-package async
	:config
	(setq async-bytecomp-package-mode 1))
#+END_SRC
** Garbage Collections and Collector
[[https://github.com/emacsmirror/gcmh]]

#+begin_src emacs-lisp :tangle "~/.config/emacs/early-init.el"
  (use-package gcmh
    :diminish gcmh-mode
    :config
    (setq gcmh-idle-delay 5
          gcmh-high-cons-threshold (* 16 1024 1024)) ; 16mb
    (gcmh-mode 1)
    )

  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-percentage 0.1)))
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "Emacs ready in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))


#+end_src

** Load system path variables
#+BEGIN_SRC emacs-lisp :tangle "~/.config/emacs/early-init.el"
  (exec-path)
  (setenv "PATH" (concat (getenv "PATH") ":/Library/TeX/texbin/"))
#+END_SRC
* Files, registers and variables
** My variables
#+BEGIN_SRC emacs-lisp
  ;;; fet-variables
  ;; File and directory locations
  (defvar fet/home (concat (getenv "HOME") "/") "My home directory.")
  (defvar fet/emacs (concat fet/home ".config/emacs/") "Emacs home directory.")
  (setq org-directory (concat fet/home "Org"))
  (defvar fet/emacs-stuff (concat fet/home "emacs-stuff") "Personal emacs files goes here.")
  (defvar fet/scripts (concat user-emacs-directory "scripts"))
  (defvar fet/snippets (concat user-emacs-directory "snippets"))
  (defvar fet/images (concat user-emacs-directory "images"))
  (defvar fet/backups (concat user-emacs-directory "backups"))
  (defvar fet/auto-save-list (concat user-emacs-directory "auto-save-list"))

  ;; Internal variables
  (defvar fet/computer 'macbook "Which computer I am on -- 'macbook or 'linux.")
  (defvar fet-text-height nil "My preferred default text height.")
  (defvar fet-doom-modeline-text-height nil "My preferred modeline text height.")
  (defvar fet-default-line-spacing 0 "Baseline line spacing")
  (setq-default fet-default-line-spacing 0)

  ;;; fet-variables ends here
#+END_SRC
** Load local scripts
#+begin_src emacs-lisp 
  (load (expand-file-name "buffer-move.el" fet/scripts))
#+end_src

** Registers
[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Registers.html]]

#+begin_src emacs-lisp 
  (setq register-preview-delay 0)
  (set-register ?C (cons 'file "~/dev/emacs/Readme.org"))
  (set-register ?G (cons 'file "~/dev/emacs/.gitignore"))

#+end_src

** Scripts
#+begin_src emacs-lisp  

  (defun fet/duplicate-line ()
	"Duplicate current line"
	(interactive)
	(move-beginning-of-line 1)
	(kill-line)
	(yank)
	(open-line 1)
	(next-line 1)
	(yank))

  (global-set-key (kbd "C-S-d") 'fet/duplicate-line)

  (defun fet/load-theme (theme)
	"Enhance 'load-theme' by first disabling enabled themes (by jake-emacs)"
	(mapc #'disable-theme custom-enabled-themes)
	(load-theme theme t))

  (defun mac-open-file ()
	(interactive)
	(let ((file (do-applescript "POSIX path of (choose file)")))
	  (if (< (length file) 3)
		  (setq file
				(substring file 1 (- (length file) 1))))
	  (if (and (not (equal file "")) (file-readable-p file))
		  (find-file file))))

  (defun mac-save-file-as ()
	(interactive)
	(let ((file (do-applescript "POSIX path of (choose file name with prompt \"Save As...\")")))
	  (if (> (length file) 3)
		  (setq file
				(substring file 1 (- (length file) 1))))
	  (if (not (equal file ""))
		  (write-file file))))
#+end_src
* General configuration
** Sane defaults
*** Disable toolbar and scrollbar, keep menubar
#+begin_src emacs-lisp :tangle "~/.config/emacs/early-init.el"
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (menu-bar-mode 1)             ;; I like having access to the menu-bar
#+END_SRC
*** Misc settings
#+BEGIN_SRC emacs-lisp
  (delete-selection-mode 1)     ;; You can select text and delete it by typing
  (electric-indent-mode 1)      ;; Turn off the weird indenting that Emacs does by default
  (electric-pair-mode -1)       ;; turns on the automatic parens pairing, I don't like it

  (global-auto-revert-mode t)   ;; Automatically show changes if the file has changed
  (global-display-line-numbers-mode 1)
  (setq-default display-line-numbers-width 5)
  (global-visual-line-mode t)   ;; Enable truncated lines
  (setq org-edit-src-content-indentation 2) ;; Set src block automatic indent to 2 (which is the default)

  ;; INTERACTION
  (setq use-short-answers t)    ;; y or n suffice when emacs asks for yes or no
  (setq confirm-kill-emacs 'yes-or-no-p)  ;; confirm to quit
  (setq initial-major-mode 'org-mode
    initial-scratch-message ""
    initial-buffer-choice t)

  ;; Window
  (setq frame-resize-pixelwise t)
  (setq ns-pop-up-frames nil)
  (setq window-resize-pixelwise nil)
  ;;(setq split-width-threshold 80)

  ;; Lines
  (setq-default truncate-lines t)
  (setq-default tab-width 4)
  (setq-default fill-column 80)
  (setq line-move-visual t)

  ;; BELL/WARNING
  (setq visible-bell nil)
  (setq ring-bell-function 'ignore)

  ;; SCROLLING
  (setq scroll-conservatively 101)
  (setq mouse-wheel-follow-mouse 't
        mouse-wheel-progressive-speed nil)
  (setq mac-redisplay-dont-reset-vscroll t
        mac-mouse-wheel-smooth-scroll nil)

  (setq what-cursor-show-names t) ;; improves C-x =

  ;; DIRED
  (setq dired-kill-when-opening-new-dired-buffer t)

  ;; MacOS stuff
  (when (string= system-type "darwin")
    (setq dired-use-ls-dired t
          insert-directory-program "/opt/homebrew/bin/gls"
          dired-listing-switches "-aBhl --group-directories-first"))
#+end_src

** Backups, recent files, history and trash
By default, Emacs saves backup files in the current directory. These are files ending in ~ that are cluttering up your directory lists. The following code stashes them all in ~/.config/emacs/backups/, where I can find them with find-file if I really need to.
*** Backups
#+begin_src emacs-lisp 
  ;; Backup
  (setq backup-directory-alist '(("." . "~/.config/emacs/backups")))
  (setq delete-old-versions -1)
  (setq version-control t)
  (setq vc-make-backup-files t)
  (setq auto-save-file-name-transforms '((".*" "~/.config/emacs/auto-save-list/" t)))
#+END_SRC
*** History
#+BEGIN_SRC emacs-lisp
  ;; History
  (setq savehist-file "~/.config/emacs/savehist")
  (savehist-mode 1)
  (setq history-length t)
  (setq history-delete-duplicates t)
  (setq savehist-save-minibuffer-history 1)
  (setq savehist-additional-variables
		'(kill-ring
		  search-ring
		  regexp-search-ring))
#+END_SRC
*** Trash
#+BEGIN_SRC emacs-lisp
  ;; Trash
  (setq trash-directory "~/.Trash")
  (setq delete-by-moving-to-trash t)
#+END_SRC
*** Recent files
#+BEGIN_SRC emacs-lisp
  ;; recent files
  (recentf-mode 1)
  (setq recentf-max-menu-items 25)
  (setq recentf-max-saved-items 25)
  (global-set-key "\C-x\ \C-r" 'recentf-open-files)
#+end_src

** Saving customizations
I don't want saved customizations in my init.el file.
Ref: [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Saving-Customizations.html]]

#+begin_src emacs-lisp 
  (setq custom-file "~/.config/emacs/emacs-custom.el")
  (load custom-file)

#+end_src

* MacOS Configuration and stuff
TODO This config is for mac os only, fix for linux

#+CAPTION: Mac keyboard bindings:
|---------------+--------------------------------------------|
| key-binding   | Does what                                  |
|---------------+--------------------------------------------|
| ⌘ + o         | Open an existing file into an Emacs buffer |
| ⌘ + w         | Discard (kill) current buffer              |
| ⌘ + s         | Save current buffer into its file          |
| ⌘ + S         | Write curent buffer into another file      |
| ⌘ + q         | Save buffer and kill Emacs                 |
| ⌘ + c         | Kill ring save (copy selected)             |
| ⌘ + v         | Yank (paste)                               |
| ⌘ + x         | Kill region (cut)                          |
| ⌘ + a         | Sellect all                                |
| ⌘ + z         | Undo                                       |
| ⌘ + f         | Search for a string (isearch)              |
| ⌘ + g         | Search forward for a string                |
| ⌘ + .         | Move to a different window (frame)         |
| ⌘ + l         | Goto line                                  |
| ⌘ + k         | Kill buffer                                |
| ⌘ + m         | Minimize the window                        |
| ⌘ + <up>      | Move point to the beginning of the buffer  |
| ⌘ + <down>    | Move point to the end of the buffer        |
| ⌘ + <left>    | Move point to beginning of current line    |
| ⌘ + <right>   | Move point to end of current line          |
| CTRL + click  | Show contextual menu                       |
| SHIFT + Click | Select region                              |
|---------------+--------------------------------------------|

#+begin_src emacs-lisp

  ;; (setq mac-command-modifier  'meta
  ;;   mac-option-modifier         nil
  ;;   mac-control-modifier       'control
  ;;   mac-right-command-modifier 'super
  ;;   mac-right-control-modifier 'hyper)

  (setq mac-option-modifier 'meta
		mac-command-modifier 'super
		mac-right-option-modifier 'none
		)

  (global-set-key (kbd "s-c") 'kill-ring-save)
  (global-set-key (kbd "s-v") 'yank)
  (global-set-key (kbd "s-x") 'kill-region)
  (global-set-key (kbd "s-a") 'mark-whole-buffer)
  (global-set-key (kbd "s-z") 'undo)
  (global-set-key (kbd "s-f") 'isearch-forward)
  (global-set-key (kbd "s-g") 'isearch-repeat-forward)
  (global-set-key (kbd "s-o") 'mac-open-file)
  (global-set-key (kbd "s-s") 'save-buffer)
  (global-set-key (kbd "s-S") 'mac-save-file-as)
  ;;(global-set-key (kbd "s-p") 'mac-preview)
  (global-set-key (kbd "s-w") 'kill-buffer)
  (global-set-key (kbd "s-m") 'iconify-frame)
  (global-set-key (kbd "s-q") 'save-buffers-kill-emacs)
  (global-set-key (kbd "s-.") 'keyboard-quit)
  (global-set-key (kbd "s-l") 'goto-line)
  (global-set-key (kbd "s-k") 'kill-buffer)
  (global-set-key (kbd "s-<up>") 'beginning-of-buffer)
  (global-set-key (kbd "s-<down>") 'end-of-buffer)
  (global-set-key (kbd "s-<left>") 'beginning-of-line)
  (global-set-key (kbd "s-<right>") 'end-of-line)
  (global-set-key [(meta down)] 'forward-paragraph)
  (global-set-key [(meta up)] 'backward-paragraph)

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

#+end_src
* Keyboard
