Readme.org
** ELFEED
[[https://github.com/skeeto/elfeed]]

#+begin_src emacs-lisp  

  (use-package elfeed
    :config
    (setq elfeed-search-feed-face ":foreground #ffffff :weight bold"
        elfeed-feeds (quote
                       (("https://www.reddit.com/r/linux.rss" reddit linux)
                        ("https://www.reddit.com/r/commandline.rss" reddit commandline)
                        ("https://www.reddit.com/r/distrotube.rss" reddit distrotube)
                        ("https://www.reddit.com/r/emacs.rss" reddit emacs)
                        ("https://www.gamingonlinux.com/article_rss.php" gaming linux)
                        ("https://hackaday.com/blog/feed/" hackaday linux)
                        ("https://opensource.com/feed" opensource linux)
                        ("https://linux.softpedia.com/backend.xml" softpedia linux)
                        ("https://itsfoss.com/feed/" itsfoss linux)
                        ("https://www.zdnet.com/topic/linux/rss.xml" zdnet linux)
                        ("https://www.phoronix.com/rss.php" phoronix linux)
                        ("http://feeds.feedburner.com/d0od" omgubuntu linux)
                        ("https://www.computerworld.com/index.rss" computerworld linux)
                        ("https://www.networkworld.com/category/linux/index.rss" networkworld linux)
                        ("https://www.techrepublic.com/rssfeeds/topic/open-source/" techrepublic linux)
                        ("https://betanews.com/feed" betanews linux)
                        ("http://lxer.com/module/newswire/headlines.rss" lxer linux)
                        ("https://distrowatch.com/news/dwd.xml" distrowatch linux)))))
 

(use-package elfeed-goodies
  :init
  (elfeed-goodies/setup)
  :config
  (setq elfeed-goodies/entry-pane-size 0.5))

#+end_src
** Eshell
[[https://github.com/4DA/eshell-toggle]]
[[https://github.com/akreisher/eshell-syntax-highlighting]]

#+begin_src emacs-lisp  

  (use-package eshell-toggle
    :custom
    (eshell-toggle-size-fraction 3)
    (eshell-toggle-use-projectile-root t)
    (eshell-toggle-run-command nil)
    (eshell-toggle-init-function #'eshell-toggle-init-ansi-term))

  (use-package eshell-syntax-highlighting
    :after esh-mode
    :config
    (eshell-syntax-highlighting-global-mode +1))

  (setq eshell-history-size 5000
        eshell-buffer-maximum-lines 5000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t
        eshell-destroy-buffer-when-process-dies t
        eshell-visual-commands '("bash" "fish" "htop" "ssh" "top" "zsh"))

#+end_src
** GPTel
#+BEGIN_SRC emacs-lisp
 ;; (use-package gptel) ;; TODO create an api-key to get going
#+END_SRC
** Magit
Magit is a complete text-based user interface to Git.
[[https://magit.vc]]

A very good writeup to get you started using Magit: [[https://www.masteringemacs.org/article/introduction-magit-emacs-mode-git]]

#+begin_src emacs-lisp 
  (use-package transient)
  (use-package magit)

  (use-package git-gutter
    :ensure t
    :init (global-git-gutter-mode +1))

  (use-package git-timemachine
    :after git-timemachine
    :hook (evil-normalize-keymaps . git-timemachine-hook)
    :config
    (evil-define-key 'normal git-timemachine-mode-map (kbd "C-j") 'git-timemachine-show-previous-revision)
    (evil-define-key 'normal git-timemachine-mode-map (kbd "C-k") 'git-timemachine-show-next-revision)
    )


#+end_src

** Thesaurus
[[https://github.com/agzam/mw-thesaurus.el]]

#+BEGIN_SRC emacs-lisp
  (use-package mw-thesaurus
    :defer t
    :config
    (add-hook 'mw-thesaurus-mode-hook
              (lambda () (define-key evil-normal-state-local-map (kbd "q") 'mw-thesaurus--quit))))
#+END_SRC
* Misc packages
#+BEGIN_SRC emacs-lisp
  (use-package restart-emacs :defer t)
  (use-package diminish)
  (use-package reveal-in-osx-finder :commands (reveal-in-osx-finder))

  #+end_src

** TLDR
[[https://github.com/kuanyui/tldr.el]]

#+begin_src emacs-lisp  

  (use-package tldr)

#+end_src
** Try
Try is a package that allows you to try out Emacs packages without installing them. If you pass a URL to a plaint text .el -file it evaluates the content, without storing the file.

Packages from ELPA will be stored in a temporary directory by default.

[[https://github.com/larstvei/Try]]

#+BEGIN_SRC emacs-lisp
  (use-package try)
#+END_SRC
* Org Mode
TODO: fix this section

[[https://orgmode.org]]
[[https://github.com/oantolin/orderless]]
[[https://github.com/alphapapa/org-make-toc]]
[[https://github.com/minad/org-modern]]
[[https://github.com/hexmode/ox-reveal]]

#+begin_src emacs-lisp
  (defvar my-agenda-files '("inbox.org" "projects.org" "habits.org" "agenda.org" "read.org"))
  (setq org-directory "~/Org"
		org-agenda-files (mapcar
						  (lambda (f) (concat (file-name-as-directory org-directory) f))
						  my-agenda-files)
		org-default-notes-file (concat (file-name-as-directory org-directory) "notes.org"))



  (use-package org-cliplink
	:defer t
	:after org)



  (require 'org-tempo)

  (use-package org-bullets)
  (add-hook 'org-mode-hook (lambda ()(org-bullets-mode 1)))

  ;(require 'org-make-toc)
  (use-package org-make-toc)

  (use-package ox-reveal
	:defer 5)

  ;; HTML-specific
  (setq org-html-validation-link nil) ;; No validation button on HTML exports

  ;; LaTeX Specific
  (eval-after-load 'ox
	'(add-to-list
	  'org-export-filter-timestamp-functions
	  'org-export-filter-timestamp-remove-brackets)
	)

  (use-package org-modern
	:hook (org-mode . org-modern-mode)
	:config
	(setq
	 ;; org-modern-star '("●" "○" "✸" "✿")
	 org-modern-star '( "⌾" "✸" "◈" "◇")
	 org-modern-list '((42 . "◦") (43 . "•") (45 . "–"))
	 org-modern-tag nil
	 org-modern-priority nil
	 org-modern-todo nil
	 org-modern-table nil))

  (setq org-return-follows-link t)
  
  ;; (use-package org-super-agenda
  ;;   :after org
  ;;   :config
  ;;   (setq org-super-agenda-header-map nil)
  ;;   (add-hook 'org-agenda-mode-hook #'(lambda () (setq-local nobreak-char-display-nil)))
  ;;   (org-super-agenda-mode))

#+end_src

#+* Org Mode Config
** LaTeX
#+begin_src emacs-lisp  
  (use-package latex
	:ensure nil
	:defer t
	:init
	(setq TeX-engine 'xetex
		  latex-run-command "/Library/TeX/texbin/xetex")
	(setq TeX-parse-self t
		  TeX-auto-save t
		  TeX-auto-local (concat user-emacs-directory "auctex/auto/")
		  TeX-style-local (concat user-emacs-directory "auctex/style/")
		  TeX-source-correlate-mode t
		  TeX-source-correlate-method 'synctex
		  TeX-show-compilation nil
		  TeX-source-correlate-start-server nil
		  TeX-electirc-sub-and-superscript t
		  TeX-save-query nil)
	(setq TeX-view-program-selection '((output-pdf "PDF Tools"))
		  TeX-view-program-list '(("PDF Tools" TeX-pdf-tools-sync-view))
		  TeX-source--correlate-start-server t)
	:general
	(general-define-key
	 :prefix ","
	 :states 'normal
	 :keymaps 'LaTeX-mode-map
	 "" nil
	 "a" '(TeX-command-run-all :wk "TeX run all")
	 "c" '(TeX-command-master :wk "TeX-command-master")
	 "e" '(LaTeX-environment :wk "Insert environment")
	 "s" '(LaTeX-section :wk "Insert section")
	 "m" '(TeX-insert-macro :wk "Insert macro")
	 )
	)
  (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)


  (require 'ox-latex)
  (unless (boundp 'org-latex-classes)
	(setq org-latex-classes nil))
  (add-to-list 'org-latex-classes
			   '("article"
				 "\\documentclass{article}"
				 ("\\section{%s}" . "\\section*{%s}")
				 ("\\subsection{%s}" . "\\subsection*{%s}")
				 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
				 ("\\paragraph{%s}" . "\\paragraph*{%s}")
				 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")
				 )
			   )
  (add-to-list 'org-latex-classes
			   '("book"
				 "\\documentclass{book}"
				 ("\\part{%s}" . "\\part*{%s}")
				 ("\\chapter{%s}" . "\\chapter*{%s}")
				 ("\\section{%s}" . "\\section*{%s}")
				 ("\\subsection{%s}" . "\\subsection*{%s}")
				 ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))
			   )
  (add-to-list 'org-latex-classes
			'("koma-article"
			   "\\documentclass{scrartcl}"
			   ("\\section{%s}" . "\\section*{%s}")
			   ("\\subsection{%s}" . "\\subsection*{%s}")
			   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
			   ("\\paragraph{%s}" . "\\paragraph*{%s}")
			   ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
  (setq org-latex-listings t)
  (setq org-latex-compiler "/Library/TeX/texbin/xelatex")

  (setq org-latex-default-packages-alist
		'(("AUTO" "inputenc" t ("pdflatex"))
		  ("T1" "fontenc" t ("pdflatex"))
		  ("" "graphics" t)
		  ("" "grffile" t)
		  ("" "longtable" nil)
		  ("" "wrapfig" nil)
		  ("" "rotating" nil)
		  ("normalem" "ulem" t)
		  ("" "amsmath" t)
		  ("" "textcomp" t)
		  ("" "amssymb" t)
		  ("" "capt-of" nil)
		  ("dvipsnames" "xcolor" nil)
		  ("dolorlinks=true, linkcolor=Blue, citecolor=BrickRed, urlcolor=PineGreen" "hyperref" nil)
		  ("" "indentfirst" nil)))

  (setq org-latex-listings 'minited
		org-latex-packages-alist '(("" "minted"))
		org-latex-minted-options '(("breaklines" "true")
								   ("breakanywhere" "true")
								   ("mathescape")
								   ("frame" "lines")
								   ("byccolor" "yellow!5")))

  (setq org-latex-pdf-process '("xelatex -pdflatex='%latex -shell-escape -interaction nonstopmode' -pdf -output-directory=%o -f %f"))
#+end_src

#+RESULTS:
| xelatex -pdflatex='%latex -shell-escape -interaction nonstopmode' -pdf -output-directory=%o -f %f |

** PDF
[[https://github.com/politza/pdf-tools]]

#+begin_src emacs-lisp  

    (use-package pdf-tools
  :defer t
  ;;:pin manual
  :mode ("\\.pdf\\'" . pdf-view-mode)
  :config
  (pdf-loader-install)
  (setq-default pdf-view-display-size 'fit-height)
  (setq pdf-view-contiuous nil)
  (setq pdf-view-midnight-colors '("#ffffff" . "#121212" ))
  :general
  (general-define-key :states 'motion :keymaps 'pdf-view-mode-map
                      "j" 'pdf-view-next-page
                      "k" 'pdf-view-previous-page
                      "C-j" 'pdf-view-next-line-or-next-page
                      "C-k" 'pdf-view-previous-line-or-previous-page
                      (kbd "<down>") 'pdf-view-next-line-or-next-page
                      (kbd "<up>") 'pdf-view-previous-line-or-previous-page
                      (kbd "<left>") 'image-backward-hscroll
                      (kbd "<right>") 'image-forward-hscroll
                      "H" 'pdf-view-fit-height-to-window
                      "0" 'pdf-view-fit-height-to-window
                      "W" 'pdf-view-fit-width-to-window
                      "+" 'pdf-view-enlarge
                      "-" 'pdf-view-shrink
                      "q" 'quit-window
                      "Q" 'kill-this-buffer
                      "g" 'revert-buffer
                      "C-s" 'isearch-forward
                      )
)

#+end_src
* Footer in init.el
#+BEGIN_SRC emacs-lisp
;;; init.el ends here
#+END_SRC
